"""
Довжина послідовності
https://www.e-olymp.com/uk/problems/8909

На вході програми маємо послідовність цілих чисел, що закінчується
числом 0. Потрібно знайти довжину даної послідовності, не
враховуючи останнього нуля.

Вхідні дані:
Послідовність цілих чисел, по одному числу в кожному рядку.
Вихідні дані:
Одне число - довжина даної послідовності.

Вхідні дані #1
7-
1
4-
6
0
Вихідні дані #1
4

Вказівка: використати оператор break для завершення циклу
"""

# Лічильник чисел. Починаємо з нуля
count = 0

# Встановлюємо нескінченний цикл
while True:
    # Зчитуємо число
    n = int(input())
    # Перевіряємо, чи дорівнює воно нулю. Якщо так, виходимо з циклу
    if n == 0:
        break
    # Якщо число не нуль, додаємо до лічильника одиницю
    count += 1

# Друкуємо результат - кількість успішно пройдених ітерацій циклу
print(count)
