"""
Кількість непарних
https://www.e-olymp.com/uk/problems/8913

Вказівка: використати оператор break для завершення циклу та
continue для пропуску парних

На вході програми маємо послідовність цілих чисел, що закінчується
числом 0. Потрібно знайти кількість непарних чисел в даній
послідовності.

Вхідні дані:
Послідовність цілих чисел, по одному числу в кожному рядку.
Вихідні дані:
Одне число - кількість непарних чисел в послідовності.

Вхідні дані #1
7-
1
4-
6
0
Вихідні дані #1
2
"""

# Лічильник чисел. Починаємо з нуля
count = 0

# Встановлюємо нескінченний цикл
while True:
    # Зчитуємо число
    n = int(input())
    # Перевіряємо, чи дорівнює воно нулю. Якщо так, виходимо з циклу
    if n == 0:
        break
    # Якщо число не нуль, перевіряємо, чи воно парне
    # Якщо число парне, починаємо наступну ітерацію циклу,
    # тобто все, що йде після слова 'continue', не читається
    if n % 2 == 0:
        continue
    # Інакше, додаємо до лічильника одиницю
    count += 1

# Друкуємо результат - кількість успішно пройдених ітерацій циклу
print(count)
