"""
Кількість парних n-значних чисел
https://www.e-olymp.com/uk/problems/8819

На вході програми маємо натуральне число n. Вивести кількість
парних n-значних натуральних чисел.

Вхідні дані:
Натуральне число n.
Вихідні дані:
Кількість парних n-значних натуральних чисел.

Вхідні дані #1
1
Вихідні дані #1
4
"""

n = int(input())

# Лічильник парних чисел
count = 0
# Пробігаємо по всім числам, які складаються з 'n' цифр
for i in range(10**(n - 1), 10**n):
    # Перевіряємо, чи число парне
    # Якщо це так, додаємо до лічильника одиницю
    if i % 2 == 0:
        count += 1

print(count)

# Дана задача може бути розв`язана простіше, якщо
# скористатися формулою напряму
# count = (10**n - 10**(n - 1)) // 2
