"""
Задача 4
https://www.e-olymp.com/uk/problems/759920

Вивести відповідь до задачі, враховуючи, що n — номер варіанту.
• n=1: Обчислити кiлькiсть двозначних чисел, цифри яких спадають.
• n=2: Обчислити кiлькiсть двозначних чисел, цифри яких зростають.
• n=3: Обчислити кiлькiсть двозначних чисел, цифри яких мають однакову парність.
• n=4: Обчислити суму двозначних чисел, цифри яких однакові.
• n=5: Обчислити суму двозначних чисел, цифри яких парні.
• n=6: Обчислити суму двозначних чисел, цифри яких непарні.

Вхідні дані:
Одне число n, 1 ≤ n ≤ 6
Вихідні дані:
Відповідь до задачі, залежно від номеру варіанту n.
"""

n = int(input())

# Перший варіант
if n == 1:
    # Змінна-дічильник, що відображає кількість чисел, згідно умови
    count = 0
    # Ітеруємо по всім двозначним числам
    for i in range(10, 100):
        # Розбиваємо число на цифри 'd1', 'd0'
        d1 = i // 10
        d0 = i % 10
        # Перевіряємо чи цифри спадають
        if d0 < d1:
            # Якщо цифри спадають, додаємо до лічильника одиницю
            count += 1
    # Друкуємо результат
    print(count)

# Другий варіант
elif n == 2:
    count = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Якщо цифри зростають, додаємо до лічильника одиницю
        if d0 > d1:
            count += 1
    print(count)

# Третій варіант
elif n == 3:
    count = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Порівнюємо парність обох цифр
        if d0 % 2 == d1 % 2:
            count += 1
    print(count)

# Четвертий варіант
elif n == 4:
    # Змінна, в яку будемо зберігати суму, згідно умови
    s = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Порівнюємо цифри
        if d0 == d1:
            # Якщо цифри рівні, додаємо двозначне число до суми
            s += i
    # Друкуємо результат суми всіх двозначних чисел, що мають однакові цифри
    print(s)

# П`ятий варіант
elif n == 5:
    s = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Перевіряємо на парність обидві цифри
        if d0 % 2 == 0 and d1 % 2 == 0:
            s += i
    print(s)

# Шостий варіант
elif n == 6:
    s = 0
    for i in range(10, 100):
        d1 = i // 10
        d0 = i % 10
        # Перевіряємо на непарність обидві цифри
        if d0 % 2 == 1 and d1 % 2 == 1:
            s += i
    print(s)
