"""
Просте число
https://www.e-olymp.com/uk/problems/8929

На вході програми маємо натуральне число n (n>1). Потрібно
перевірити, чи задане число — просте, тобто ділиться тільки на 1 і n.

Вхідні дані:
Натуральне число n (n>1).
Вихідні дані:
Вивести 1, якщо число n просте і 0 у протилежному випадку.

Вхідні дані #1
7
Вихідні дані #1
1

Вхідні дані #2
15
Вихідні дані #2
0
"""

# Імпортуємо модуль математичних функцій
import math

# Вводимо натуральне число
n = int(input())

# Число, до якого будемо ітерувати
# Ціла частина корня квадратного від 'n' плюс один
k = int(math.sqrt(n)) + 1
# Ітеруємо від 2 до квадратного кореня
# Ітерація проводиться саме до квадратного кореня , оскільки немає смислу
# перевіряти далі (згодом буде доведено відповідну теорему)
for i in range(2, k):
    # Якщо число 'n' ділиться на якесь число з відрізку [2, k]
    # можна стверджувати, що число не є простим,
    # тому друкуємо '0' і виходимо з циклу
    if n % i == 0:
        print(0)
        break
# У випадку успішного завершення циклу (тобто не виходом 'break'),
# можемо стверджувати, що число просте, тому друкуємо '1'
else:
    print(1)
